In [1]:
import pandas as pd
%matplotlib inline
from sqlalchemy import create_engine

# Contains the Postgres login information
engine = create_engine('postgresql://postgres:postgres@localhost:5432/Employee_db')
connect = engine.connect()

#runs a test import from table and shows head
test = pd.read_sql_query('SELECT * FROM employees', connect)
test.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12